{
  "education": [
    {
      "awards_achievements": [
        "GPA: 3.8/4.0",
        "Presented 'Rent Analysis \u0026 Municipal Services Call Analysis of Windsor City' Data Visualization project to ambassadors of Argentina, Chile, Ecuador, and Peru",
        "Class Representative, Student Council"
      ],
      "degree": "Post-graduate Certificate",
      "department": "Data Analytics for Business",
      "duration": "2019-2020",
      "school_name": "St. Clair College"
    },
    {
      "awards_achievements": [
        "GPA: 3.5/4.0",
        "President, Tech Club",
        "President, Campus Events Committee"
      ],
      "degree": "Bachelor of Computer Application",
      "department": "Computer Science",
      "duration": "2015-2018",
      "school_name": "Ahmedabad University"
    }
  ],
  "github_repo_root_url": "https://github.com/jarviscanada/jarvis_data_eng_AdityaKhajanchi",
  "highlighted_projects": [
    {
      "description": "Developed an interactive Chicago crime heatmap dashboard using Dash and Plotly, allowing users to filter data by crime type, month, or view all available data. Leveraged real-time data from the City of Chicago's public API, utilizing Pandas for data manipulation and Plotly's density_mapbox for visualizing crime density on an interactive map. Implemented dynamic dropdowns, checklists, and callbacks to enable real-time filtering and updates. Integrated Mapbox for precise geographical mapping and customized the user interface with CSS for an enhanced user experience. The dashboard provides a comprehensive view of crime trends and hotspots across the city.",
      "git_url": "https://github.com/ANK002X/DA-Projects/blob/2489f63ced2365bece7fa054d2a22f3bf85444d4/PersonalProjects/4a_ChicagoCrimesDataVisualization%5BView_in_Browser%5D.ipynb",
      "name": "Interactive Crime Map for Chicago"
    },
    {
      "description": "Collaborated with a team of 7 to develop the Global Superstore Dashboard, an interactive data visualization tool aimed at providing in-depth insights into sales, profit, shipping, and customer segmentation for a global retail operation. Using Dash and Plotly, we built a dynamic dashboard that allows users to explore Year-to-Date (YTD) metrics, such as total sales, orders, and products sold, alongside key performance indicators like sales growth and shipping time. Leveraging Pandas for data processing, we incorporated advanced charts, including area charts, sunburst, funnel, and waterfall plots, to visually present trends, geographical distributions, and customer behavior. The dashboard also integrates dynamic filters, allowing users to select different report types and years for flexible data exploration. This project successfully delivered an intuitive platform for management to analyze real-time business performance and make informed decisions.",
      "git_url": "https://github.com/ANK002X/DA-Projects/blob/750f60b370b02b5b05f3597072e7143bf7eb3e04/1_TheGlobalSuperstore-Insights_Graphs.ipynb",
      "name": "Superstore Dashboard"
    }
  ],
  "jarvis_projects": [
    {
      "description": "Developed an automated monitoring solution for the Linux Cluster Administration (LCA) team to track hardware specifications and real-time resource usage across Rocky Linux servers. Integrated Bash scripts with PostgreSQL to store data persistently, using Docker for containerized deployment and crontab for scheduled execution. Leveraged Git for version control and implemented a scalable system that supports performance analysis, reporting, and future capacity planning. Demonstrated proficiency in Linux system administration, scripting, database management, and DevOps practices.",
      "git_url": "/linux_sql",
      "name": "Cluster Monitor"
    }
  ],
  "name": "Aditya Khajanchi",
  "others": [
    {
      "bullets": [
        "IBM, Certified Data Analyst (2024)",
        "Microsoft, Azure AI Fundamentals [AI-900] (2024)",
        "Microsoft, Certified Power BI Data Analyst Associate [PL300] (Expected 2025)",
        "Google, Foundations of Project Management  (Expected 2025)"
      ],
      "title": "Certificates"
    },
    {
      "bullets": [
        "Winner, Best Data Visualization Project, St. Clair College (2019)"
      ],
      "title": "Awards"
    },
    {
      "bullets": [
        "I enjoy participating in professional seminars and networking events to stay updated in my field and connect with like-minded professionals.",
        "I enjoy tackling DIY projects every other weekend, whether it's around the house, working on my car, or tech-related fixes.",
        "I love experimenting with fusion cooking for my friends, and family, creating unique dishes that blend different cuisines and flavors."
      ],
      "title": "Activities/Hobbies"
    }
  ],
  "professional_experience": [
    {
      "company": "Jarvis",
      "description": "This section is currently in progress. More content will be added soon. Thank you.",
      "duration": "2025-present",
      "title": "Business Systems Analyst"
    },
    {
      "company": "Geopogo",
      "description": "Collaborated to develop a Tableau dashboard displaying KPIs from 12+ data sources for stakeholders, including investors, senior management, and team leads. Implemented an ETL pipeline to semi-automate data transformation, reducing manual data entry by 50% and saving up to 5 hours weekly. Streamlined data management for ZoneQuestAI by implementing batch imports/exports and scheduled backups in Firebase, enhancing process efficiency, data integrity, and accessibility. Identified key usage and engagement trends that led to a 15% increase in engagement and 25% increase in organic growth through data-driven recommendations. Contributed to the research, extraction, and implementation of GIS data from publicly available sources to integrate into the latest release.",
      "duration": "2022-Present",
      "title": "Data Analyst"
    },
    {
      "company": "Architecttura Architects",
      "description": "Implemented an Excel productivity tracker for LiDAR scanning projects, reducing project turnaround time by 35%. Developed and maintained a Power BI dashboard, presenting insights on operational efficiency and project timelines to senior management in weekly meetings. Coordinated 25+ projects, managing initiatives over $10MM for The City of Windsor and $30MM for Ontario School Boards. Liaised with internal and external project stakeholders to improve process efficiency. Maintained clear and concise documentation and user guides for knowledge transfer.",
      "duration": "2021-2022",
      "title": "Analyst, Coordinator, Software Engineering"
    },
    {
      "company": "Concentrix",
      "description": "Developed strong problem-solving skills by creating, updating, and efficiently resolving IT support tickets for users with iOS, macOS devices, while exceeding SLA requirements by 12%.",
      "duration": "2020-2021",
      "title": "Technical Support Advisor"
    }
  ],
  "skills": {
    "competent": [
      "MS SQL Server",
      "VISIO",
      "Tableau, PowerBI",
      "Data ETL",
      "Looker",
      "Trello",
      "C# .NET",
      "Documentation",
      "Azure AI Services"
    ],
    "familiar": [
      "R",
      "DAX",
      "Firebase",
      "Snowflake",
      "JIRA",
      "MS Project",
      "Technical Writing"
    ],
    "proficient": [
      "Python",
      "Reporting",
      "Presentations",
      "RDBMS/SQL",
      "Advanced Excel, PowerQuery",
      "Agile/Scrum",
      "GIS Data",
      "Git"
    ]
  },
  "summary": "I am a curious, detail-oriented, and enthusiastic professional with strong communication and collaboration skills. I enjoy taking on new challenges and solving business problems that drive meaningful impact and support organizational goals. Proficient in SQL, Python, Advanced Excel, Power BI, and other analytical tools, I analyze requirements, identify patterns, derive actionable insights, and recommend process improvements to support data-driven decision-making. Across my academic and professional experiences, I have contributed to cross-functional projects through leadership, stakeholder engagement, and adaptability in fast-paced environments."
}
