{
  "education": [
    {
      "awards_achievements": [
        "GPA: 3.9/4.0",
        "Presented 'Rent Analysis \u0026 Municipal Services Call Analysis of Windsor City' Data Visualization project to ambassadors of Argentina, Chile, Ecuador, and Peru",
        "Class Representative, Student Council"
      ],
      "degree": "Post-graduate Certificate",
      "department": "Data Analytics",
      "duration": "2019-2020",
      "school_name": "Zekelman School of Business, St. Clair College"
    },
    {
      "awards_achievements": [
        "GPA: 3.8/4.33",
        "President, Computer and Tech Club",
        "President, Campus Events Committee",
        "Class Representative, Student Council"
      ],
      "degree": "Bachelor of Computer Application",
      "department": "Computer Applications",
      "duration": "2015-2018",
      "school_name": "School of Computer Studies, Ahmedabad University"
    }
  ],
  "github_repo_root_url": "https://github.com/jarviscanada/jarvis_data_eng_AdityaKhajanchi",
  "highlighted_projects": [
    {
      "description": "Developed an interactive Chicago crime heatmap dashboard using Dash and Plotly, allowing users to filter data by crime type, month, or view all available data. Leveraged real-time data from the City of Chicago's public SOD API, utilizing Pandas for data manipulation and Plotly's density_mapbox for visualizing crime density on an interactive map. Implemented dynamic dropdowns, checklists, and callbacks to enable real-time filtering and updates. Integrated Mapbox for precise geographical mapping and customized the user interface with CSS for an enhanced user experience. The dashboard provides a comprehensive view of crime trends and hotspots across the city.",
      "git_url": "https://github.com/ANK002X/DA-Projects/blob/2489f63ced2365bece7fa054d2a22f3bf85444d4/PersonalProjects/4a_ChicagoCrimesDataVisualization%5BView_in_Browser%5D.ipynb",
      "name": "Interactive Crime Map for Chicago"
    },
    {
      "description": "Collaborated with a team of 7 to develop the Global Superstore Dashboard, an interactive data visualization tool aimed at providing in-depth insights into sales, profit, shipping, and customer segmentation for a global retail operation. Using Dash and Plotly, we built a dynamic dashboard that allows users to explore Year-to-Date (YTD) metrics, such as total sales, orders, and products sold, alongside key performance indicators like sales growth and shipping time. Leveraging Pandas for data processing, we incorporated advanced charts, including area charts, sunburst, funnel, and waterfall plots, to visually present trends, geographical distributions, and customer behavior. The dashboard also integrates dynamic filters, allowing users to select different report types and years for flexible data exploration. This project successfully delivered an intuitive platform for management to analyze real-time business performance and make informed decisions.",
      "git_url": "https://github.com/ANK002X/DA-Projects/blob/40af22f44b816dcf8926f9eab1e9fdd20caabe4b/PersonalProjects/1_TheGlobalSuperstore-Insights_Graphs.ipynb",
      "name": "Superstore Dashboard"
    }
  ],
  "jarvis_projects": [
    {
      "description": "Designed a system architecture diagram outlining the end-to-end data flow---from raw CSV ingestion to processed insights and final dashboard outputs---to support scalable analysis for London Gift Shop (LGS), an online retail business. Built a Python-based data analytics proof of concept (PoC) that included data cleaning, preprocessing, and exploratory data analysis (EDA) using `pandas`, `NumPy`, and visualization libraries like `Matplotlib`, `Seaborn`, `Plotly`, and `Folium`. Engineered logic to detect null values, correct data types, and enrich records by mapping countries to continents. Created interactive charts to uncover sales trends, regional patterns, and customer behaviors. Developed a Recency-Frequency-Monetary (RFM) matrix to segment customers and guide targeted marketing. Showcased proficiency in Python scripting, statistical analysis, data wrangling, and building insight-driven visual narratives to support retail decision-making.",
      "git_url": "/python_data_analytics",
      "name": "Customer Analytics and RFM Segmentation for LGS (PoC)"
    },
    {
      "description": "Completed a hands-on Business Systems Analyst training project focused on two core deliverables. First, authored a comprehensive Business Requirements Document (BRD) for a Linux Cluster Monitoring Agent solution to support automated, real-time resource tracking across up to 100 Rocky Linux servers. The BRD defined project scope, functional and non-functional requirements, stakeholder roles, and a cost-benefit analysis to guide development. Second, conducted an in-depth interview with a business stakeholder to gather requirements for a stock trading application. Based on the insights, developed a System Requirements Document (SRD) for the software development lead, clearly outlining business goals, functional specifications, user needs, and system behavior to support informed development planning.",
      "git_url": "",
      "name": "BSA Fundamentals"
    },
    {
      "description": "Developed an automated monitoring solution for the Linux Cluster Administration (LCA) team to track hardware specifications and real-time resource usage across Rocky Linux servers. Integrated Bash scripts with PostgreSQL to store data persistently, using Docker for containerized deployment and crontab for scheduled execution. Leveraged Git for version control and implemented a scalable system that supports performance analysis, reporting, and future capacity planning. Demonstrated proficiency in Linux system administration, scripting, database management, and DevOps practices.",
      "git_url": "/linux_sql",
      "name": "Cluster Monitor"
    }
  ],
  "name": "Aditya Khajanchi",
  "others": [
    {
      "bullets": [
        "IBM, Certified Data Analyst (2024)",
        "Microsoft, Azure AI Fundamentals [AI-900] (2024)",
        "Microsoft, Certified Power BI Data Analyst Associate [PL300] (Expected 2025)",
        "Google, Foundations of Project Management (Expected 2025)"
      ],
      "title": "Certificates"
    },
    {
      "bullets": [
        "Winner, Best Data Visualization Project, St. Clair College (2019)"
      ],
      "title": "Awards"
    },
    {
      "bullets": [
        "I enjoy participating in professional seminars and networking events to stay updated in my field and connect with like-minded professionals, which helps me stay current with industry trends and continuously refine my communication and interpersonal skills.",
        "I like tackling DIY projects every other weekend, whether it's around the house, working on my car, or tech-related fixes, as they sharpen my troubleshooting, creativity, and problem-solving abilities, skills I often carry into my professional work.",
        "I love experimenting with fusion cooking for my friends and family, creating unique dishes that blend different cuisines and flavors. It has strengthened my patience, attention to detail, and flexibility while also teaching me how to improvise and create something great out of minimal resources."
      ],
      "title": "Activities/Hobbies"
    }
  ],
  "professional_experience": [
    {
      "company": "Jarvis",
      "description": "Participated in the Business Systems Analyst stream of Jarvis's Talent Incubation (TIC) program, simulating real-world business environments. Developed key competencies in business analysis, including requirements gathering, documentation, and stakeholder engagement. Acquired technical skills in relational database management, cloud computing, Linux scripting, and Python programming. Applied project management methodologies such as Agile, Scrum, Waterfall, and Kanban to manage deliverables in team-based scenarios. Collaborated with cross-functional peers to solve business problems and deliver structured documentation under simulated workplace timelines. Strengthened communication and critical thinking skills through iterative feedback and peer reviews.",
      "duration": "2025-present",
      "title": "Business Systems Analyst"
    },
    {
      "company": "Geopogo",
      "description": "Collaborated to develop a Tableau dashboard displaying KPIs from 12+ data sources for stakeholders, including investors, senior management, and team leads. Implemented an ETL pipeline to automate data transformation, reducing manual data entry by 50% and saving up to 5 hours weekly. Streamlined data management for ZoneQuestAI by implementing batch imports/exports and scheduled backups in Firebase, enhancing process efficiency, data integrity, and accessibility. Identified key usage and engagement trends that led to a 15% increase in engagement and 25% increase in organic growth through data-driven recommendations. Contributed to the research, extraction, and implementation of GIS data from publicly available sources to integrate into the latest release.",
      "duration": "2022-Present",
      "title": "Data Analyst"
    },
    {
      "company": "Architecttura Architects",
      "description": "Implemented an Excel productivity tracker for LiDAR scanning projects, reducing project turnaround time by 35%. Developed and maintained a Power BI dashboard, presenting insights on operational efficiency and project timelines to senior management in weekly meetings. Coordinated 25+ projects, managing initiatives over $10MM for The City of Windsor and $30MM for Ontario School Boards. Liaised with internal and external project stakeholders to improve process efficiency. Maintained clear and concise documentation and user guides for knowledge transfer.",
      "duration": "2021-2022",
      "title": "Analyst, Coordinator, Software Engineering"
    }
  ],
  "skills": {
    "competent": [
      "Agile/Scrum",
      "Python",
      "MS SQL Server",
      "ETL",
      "Azure AI Services",
      "PowerBI",
      "C# .NET",
      "Looker",
      "Visio",
      "GIS Data",
      "Trello",
      "Documentation"
    ],
    "familiar": [
      "R",
      "Snowflake",
      "JIRA",
      "DAX",
      "Keras",
      "TensorFlow",
      "OpenCV",
      "Firebase",
      "JAVA",
      "MS Project",
      "Technical Writing"
    ],
    "proficient": [
      "SQL",
      "Tableau",
      "Excel, PowerQuery",
      "Reporting",
      "Presentations",
      "Git"
    ]
  },
  "summary": "I am a curious and enthusiastic Business Systems Analyst with strong communication and collaboration skills. I enjoy taking on new challenges and solving business problems that drive meaningful impact and support organizational goals. Utilized a combination of Excel, Python, and Tableau, at Geopogo to automate data workflows, identify patterns, centralize analytics, and deliver strategic insights. Across my academic and professional experiences, I have contributed to cross-functional projects through leadership, stakeholder engagement, and adaptability in dynamic and fast-paced environments."
}
